import pandas as pd
from teapy import Expr, calc_ret_single
from teapy.testing import assert_allclose


def test_calc_ret_single():
    df = pd.DataFrame(
        {
            "time": pd.date_range("2020-01-01", "2020-01-07"),
            "open": [98, 100, 103, 105, 96, 220, 226],
            "close": [100, 102, 105, 96, 90, 226, 220],
            "contract_chg_signal": [0, 0, 0, 0, 0, 1, 0],
            "pos": [0, 1, 1, 0.5, -0.5, -0.5, 0],
        }
    )

    out = calc_ret_single(
        pos=df["pos"],
        opening_cost=df["open"],
        closing_cost=df["close"],
        init_cash=1_000_000,
        c_rate=3e-4,
        contract_change_signal=df["contract_chg_signal"],
        multiplier=10,
        leverage=2,
    ).eview()

    # time0: 1_000_000
    # time1:
    #   买入 1_000_000 * 2 * 1 / (100 * 10) = 2000手
    #   手续费: 1_000_000 * 2 * 0.0003 = 600
    #   当期损益:  (102-100) * 2000 * 10 = 40000
    #   1_000_000 - 600 + 40000 = 1_039_400
    # time2:
    #   1_039_400 + (105-102) * 2000 * 10 = 1_099_400
    # time3:
    #   目标持仓手数: 1_099_400 * 2 * 0.5 / (105 * 10) = 1047
    #   换仓手续费: (2000 - 1047) * 10 * 105 * 0.0003 = 300.195
    #   当期损益: (96 - 105) * 1047 * 10  = -94230
    #   1_099_400 - 94230 - 300.195 = 1_004_869.805
    # time4:
    #   目标持仓手数: 1_004_869.805 * 2 * -0.5 / (96 * 10) = -1046
    #   手续费: (1047 + 1046) * 96 * 10 * 0.0003 = 602.784
    #   当期损益: (90 - 96) * -1046 * 10 = 62760
    #   1_004_869.805 - 602.784 + 62760 = 1067027.021
    # time5: 换月
    #   新的目标持仓手数: (1067027.021 * 2 * -0.5) / (10 * 220) = -485
    #   平仓并重新开仓的手续费(以新的开仓价近似计算手续费): 485 * 2 * 220 * 10 * 0.0003=640.20
    #   当期损益:  (226 - 220) * -485 * 10 = -29100
    #   1067027.021 - 29100 - 640.20 = 1037286.821
    # time6:
    #   平仓手续费:  485 * 226 * 10 * 0.0003 = 328.83
    #   损益:  -485 * (226 - 226) * 10 = 0
    #   1037286.821 - 328.83 = 1036957.991

    expect = Expr(
        [
            1_000_000,
            1_039_400,
            1_099_400,
            1_004_869.805,
            1067027.021,
            1037286.821,
            1036957.991,
        ]
    ).view
    assert_allclose(out, expect)
